app/controllers/maps_controller.rb

  def show
    @map = Map.find(params[:id])
---
SELECT * FROM `maps` WHERE (`maps`.`id` = 1)

  def edit
    @map = Map.find(params[:id])
---
SELECT * FROM `maps` WHERE (`maps`.`id` = 1)

  def update
    @map = Map.find(params[:id])
---
SELECT * FROM `maps` WHERE (`maps`.`id` = 1)