app/controllers/maps_controller.rb

SELECT * FROM `maps`
---
  def index
    @maps = Map.all

SELECT * FROM `maps` WHERE (`maps`.`permalink` = 'pilot') LIMIT 1
---
  def show
    @map = Map.find_by_permalink(params[:id], :include => [:spots])

SELECT * FROM `maps` WHERE (`maps`.`permalink` = 'pilot') LIMIT 1
---
  def edit
    @map = Map.find_by_permalink(params[:id])

INSERT INTO `maps` (`name`, `permalink`, `updated_at`, `description`, `created_at`) VALUES('sb', 'sb', '2009-04-07 09:37:49', 'spots around santa barbara', '2009-04-07 09:37:49')
---
  def create
    @map = Map.new(params[:map])

    respond_to do |format|
      if @map.save

SELECT `maps`.id FROM `maps` WHERE (permalink = 'pilot' and id != 1) LIMIT 1
UPDATE `maps` SET `updated_at` = '2009-04-04 22:27:40', `description` = 'A trip to San Diego..' WHERE `id` = 1
---
  def update
    @map = Map.find_by_permalink(params[:id])

    respond_to do |format|
      if @map.update_attributes(params[:map])