app/controllers/spots_controller.rb

  def show
    @spot = Spot.find(params[:id])
---
SELECT * FROM `spots` WHERE (`spots`.`id` = 0)

  def edit
    @spot = Spot.find(params[:id])
---
SELECT * FROM `spots` WHERE (`spots`.`id` = 0)