app/controllers/spots_controller.rb

SELECT * FROM `spots`
---
  def index
    @spots = Spot.all

SELECT * FROM `spots` WHERE (`spots`.`permalink` = 'coastroute') LIMIT 1
---
  def show
    @spot = Spot.find_by_permalink(params[:id])

SELECT * FROM `spots` WHERE (`spots`.`permalink` = 'bernard') LIMIT 1
---
  def edit
    @spot = Spot.find_by_permalink(params[:id])

INSERT INTO `spots` (`name`, `permalink`, `map_id`, `updated_at`, `region`, `flickr_user`, `county`, `neighbourhood`, `flickr_photo_id`, `country`, `description`, `flickr_medium_url`, `height`, `locality`, `lat`, `flickr_square_url`, `long`, `created_at`, `width`) VALUES('lagoon', 'lagoon-2', 1, '2009-04-09 05:35:10', 'California', 'sikelianos', 'Santa Barbara', '', '3416061402', 'United States', 'Uploaded with Flickup on iPhone.', 'http://farm4.static.flickr.com/3627/3416061402_30fc2606ac.jpg', 1200, '', '34.419761', 'http://farm4.static.flickr.com/3627/3416061402_30fc2606ac_s.jpg', '-119.66168', '2009-04-09 05:35:10', 1600)
---
  def create
    @spot = @map.spots.new(params[:spot])

    respond_to do |format|
      if @spot.save

SELECT * FROM `spots` WHERE (`spots`.`permalink` = 'coastroute') LIMIT 1
UPDATE `spots` SET `lat` = '34.420889', `long` = '-119.606823', `updated_at` = '2009-04-07 09:55:42' WHERE `id` = 2
---
  def update
    @spot = Spot.find_by_permalink(params[:id])

    respond_to do |format|
      if @spot.update_attributes(params[:spot])

SELECT * FROM `maps` WHERE (`maps`.`permalink` = 'pilot') LIMIT 1
---
  def load_map
    @map = Map.find_by_permalink(params[:map_id])