app/controllers/static_controller.rb

  def index
    @maps = Map.all
---
SELECT * FROM `maps`